test.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 10
      arrivalRate: 1
      name: Artillery HW Test
  payload:
      -
        path: "parametrs.csv"
        fields:
          - "login"
          - "password"
        order: sequence
  plugins:
     ensure: {}
  ensure:
    thresholds:
        - http.response_time.p95: 1000
        - http.response_time.p99: 1000
    conditions:
        - expression: vusers.failed == 0
        - expression: vusers.created == 10
        - expression: http.responses == 30
        - expression: "http.request_rate >= 3 and http.response_time.max < 2000"
scenarios:
- name: Getting a resource
  flow:
    - get:
        url: "{{ target }}get"
        capture:            
            - json: "$.url"
              as: "request_url_get"
    - log: "Requested url_get is: {{request_url_get}}"
    - post:
        url: "{{ target }}post"
        json:
          username: "{{login}}"
          password: "{{password}}"
        capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
            - json: "$.url"
              as: "request_url_post"
    - log: "Json value from response is: {{request_body}}"
    - log: "Host value from response is: {{host}}"
    - log: "Requested url_post is: {{request_url_post}}"
    - delete:
        url: "{{ target }}delete"